In [1]:
import pandas as pd

In [2]:
left = pd.DataFrame({'key':['K0','K1','K2','K3'],'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3']})
right = pd.DataFrame({'key':['K0','K1','K2','K3'],'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']})

In [3]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [4]:
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

# 基于key字段的合并

In [5]:
res = pd.merge(left,right,on='key')
res

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [6]:
left = pd.DataFrame({'key1':['K0','K0','K1','K2'],'key2':['K0','K1','K0','K1'],'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3']})
right = pd.DataFrame({'key1':['K0','K1','K1','K2'],'key2':['K0','K0','K0','K0'],'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']})

In [7]:
left

    A   B key1 key2
0  A0  B0   K0   K0
1  A1  B1   K0   K1
2  A2  B2   K1   K0
3  A3  B3   K2   K1

In [8]:
right

    C   D key1 key2
0  C0  D0   K0   K0
1  C1  D1   K1   K0
2  C2  D2   K1   K0
3  C3  D3   K2   K0

# 内连接，合相同

In [9]:
res = pd.merge(left,right,on=['key1','key2'],how='inner')
res

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

# 外连接，互补空

In [10]:
res = pd.merge(left,right,on=['key1','key2'],how='outer')
res

     A    B key1 key2    C    D
0   A0   B0   K0   K0   C0   D0
1   A1   B1   K0   K1  NaN  NaN
2   A2   B2   K1   K0   C1   D1
3   A2   B2   K1   K0   C2   D2
4   A3   B3   K2   K1  NaN  NaN
5  NaN  NaN   K2   K0   C3   D3

# 右连接，左补空

In [11]:
res = pd.merge(left,right,on=['key1','key2'],how='right')
res

     A    B key1 key2   C   D
0   A0   B0   K0   K0  C0  D0
1   A2   B2   K1   K0  C1  D1
2   A2   B2   K1   K0  C2  D2
3  NaN  NaN   K2   K0  C3  D3

# 左连接，右补空

In [12]:
res = pd.merge(left,right,on=['key1','key2'],how='left')
res

    A   B key1 key2    C    D
0  A0  B0   K0   K0   C0   D0
1  A1  B1   K0   K1  NaN  NaN
2  A2  B2   K1   K0   C1   D1
3  A2  B2   K1   K0   C2   D2
4  A3  B3   K2   K1  NaN  NaN

In [13]:
df1 = pd.DataFrame({'col1':[0,1], 'col_left':['a','b']})
df2 = pd.DataFrame({'col1':[1,2,2],'col_right':[2,2,2]})

In [14]:
df1

   col1 col_left
0     0        a
1     1        b

In [15]:
df2

   col1  col_right
0     1          2
1     2          2
2     2          2

# 合并结果提示

In [16]:
res = pd.merge(df1,df2,on='col1',how='outer',indicator=True)
res

   col1 col_left  col_right      _merge
0     0        a        NaN   left_only
1     1        b        2.0        both
2     2      NaN        2.0  right_only
3     2      NaN        2.0  right_only

In [17]:
res = pd.merge(df1,df2,on='col1',how='outer',indicator='indicator_column')
res

   col1 col_left  col_right indicator_column
0     0        a        NaN        left_only
1     1        b        2.0             both
2     2      NaN        2.0       right_only
3     2      NaN        2.0       right_only

In [18]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                                  'B': ['B0', 'B1', 'B2']},
                                  index=['K0', 'K1', 'K2'])
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                                     'D': ['D0', 'D2', 'D3']},
                                      index=['K0', 'K2', 'K3'])

In [19]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [20]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

## 按索引合并

In [21]:
res = pd.merge(left, right, left_index=True, right_index=True, how='outer')
res

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [22]:
res = pd.merge(left, right, left_index=True, right_index=True, how='inner')
res

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [23]:
boys = pd.DataFrame({'k': ['K0', 'K1', 'K2'], 'age': [1, 2, 3]})
girls = pd.DataFrame({'k': ['K0', 'K0', 'K3'], 'age': [4, 5, 6]})

In [24]:
boys

   age   k
0    1  K0
1    2  K1
2    3  K2

In [25]:
girls

   age   k
0    4  K0
1    5  K0
2    6  K3

# 名称相同，值不同的字段，补后缀区分

In [26]:
res = pd.merge(boys, girls, on='k', suffixes=['_boy', '_girl'], how='inner')
res

   age_boy   k  age_girl
0        1  K0         4
1        1  K0         5